Merge pull request #2 from nekronos-gh/pbft
Add full readme
